app/models/delivery.rb

  def self.seed
    CSV.read("lib/assets/delivery.csv")[1..-1].map{|p| Delivery.find_or_create_by(placement_id: p[0], date: Date.strptime(p[1], '%m/%d/%Y'), impressions: p[2])}
---
INSERT INTO "deliveries" ("date", "impressions", "placement_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["date", "2017-11-01"], ["impressions", 33427], ["placement_id", 1], ["created_at", "2019-02-09 22:11:12.265850"], ["updated_at", "2019-02-09 22:11:12.265850"]]
SELECT  "deliveries".* FROM "deliveries" WHERE "deliveries"."placement_id" = $1 AND "deliveries"."date" = $2 AND "deliveries"."impressions" = $3 LIMIT $4  [["placement_id", 1], ["date", "2017-11-01"], ["impressions", 33427], ["LIMIT", 1]]