app/models/placement.rb

INSERT INTO "placements" ("id", "name", "start", "end", "cpm", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["id", 1], ["name", "Sports"], ["start", "2017-11-01"], ["end", "2017-11-30"], ["cpm", 5], ["created_at", "2019-02-09 22:11:12.226150"], ["updated_at", "2019-02-09 22:11:12.226150"]]
SELECT  "placements".* FROM "placements" WHERE "placements"."id" = $1 AND "placements"."name" = $2 AND "placements"."start" = $3 AND "placements"."end" = $4 AND "placements"."cpm" = $5 LIMIT $6  [["id", 1], ["name", "Sports"], ["start", "2017-11-01"], ["end", "2017-11-30"], ["cpm", 5], ["LIMIT", 1]]
---
  def self.seed
    CSV.read("lib/assets/placements.csv")[1..-1].map{|p| Placement.find_or_create_by(id: p[0], name: p[1], start: Date.strptime(p[2], '%m/%d/%y'), end: Date.strptime(p[3], '%m/%d/%y'), cpm: p[4])}